Revit 2027 API
ParameterTypeId.StairstypeIntermediateSupportType Property
 "Middle Support Type": Intermediate Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeIntermediateSupportType { get; }
Public Shared ReadOnly Property StairstypeIntermediateSupportType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeIntermediateSupportType {
	ForgeTypeId^ get ();
}
static member StairstypeIntermediateSupportType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace